Tekla Open API Reference for Tekla Structures 2025
MarkBase.MarkBaseAttributes.TextAlignOptions Enumeration
 Enumeration of the possible text alignment values.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum TextAlignOptions
Public Enumeration TextAlignOptions
Members
Member name | Value | Description
Left | 0 |  Text is left-aligned.
Center | 1 |  Text is center-aligned.
Right | 2 |  Text is right-aligned.
See Also
Reference
Tekla.Structures.Drawing Namespace